#
# required
#
cask "utm"                          # `utm`                     - vms by qemu
cask "visual-studio-code"           # `code`                    - ide by ms
cask "vagrant"                      # `vagrant`                 - cli for vms
cask "vlc"                          # `vlc`                     - best media player ever
cask "rar"                          # `unrar`                   - work with rar archives
cask "chromedriver"                 # `chromedriver`            - headless chrome selenium driver

#
# optional
#
# osx apps (casks)
cask "spotify"                      # 🔊
cask "iterm2"                       # `iterm`                   - hip cool replacement for Terminal.app
cask "bot-framework-emulator"       # `bot-framework-emulator`  - interact with ms bot framework bots
cask "google-chrome"                # `chrome`                  - browser by the goog
cask "discord"                      # `discord`                 - [voice]chat with friends
cask "processing"                   # `processing`              - monome programming
cask "vcv-rack"                     # `vcv-rack`                - monome visual plugin
cask "qflipper"                     # `qflipper`                - flipper zero firmware flasher
cask "arduino-ide"                  # `arduino-ide`             - arduino firmware flasher
cask "silicon-labs-vcp-driver"      # `silicon-labs-vcp-driver` - CP210x USB to UART Bridge VCP Driver
cask "rectangle"                    # `rectangle`               - window snapping
cask "macfuse"                      # `libfuse`                 - FUSE for mac
cask "gb-studio"                    # `gb-studio`               - create homebrew gameboy games
cask "pixelorama"                   # `pixelorama`              - sprite editor

# taps
# `rage` 
tap "str4d.xyz/rage", "https://str4d.xyz/rage"
tap "hashicorp/tap"

# `vfkit`
tap "cfergeau/crc"
brew "vfkit"

# tools
brew "zsh"                          # `zsh`                     - if Jason Bourne went to MIT
brew "bash"                         # `bash`                    - because Apply daddy won't fight GPLv3
brew "vim"                          # `vim`                     - for maximum improvedness
brew "dust"                         # `dust`                    - a tree based `du` with a desert name
brew "tealdeer"                     # `tldr`                    - rusty abbreviated manpages
brew "chezmoi"                      # `chezmoi` (alias: cm*)    - manages dotfiles
brew "n"                            # `n`                       - manages node versions
brew "fzf"                          # `fzf`                     - finds fuzzy stuff wait n-
brew "ripgrep"                      # `rg`                      - greps stuff real good
brew "glances"                      # `glances`                 - a quickview of top and ps
brew "pandoc"                       # `pandoc`                  - turn one type of document into 50 different types of document
brew "gnupg"                        # `gpg`                     - bob and alice are up to no good.. or are they?
brew "gpg2"                         # `gpg2`                    - bob and alice but a little newer
brew "pinentry-mac"                 # `pinentry`                - pinentry for macs
brew "parallel"                     # `parallel`                - now the whole neighborhood is up to no good
brew "azure-cli"                    # `az`                      - microsoft daddy
brew "awscli"                       # `aws`                     - amazon daddy
brew "kubectl"                      # `kubectl`                 - kubernetes is fun
brew "dive"                         # `dive`                    - inspect docker layers
brew "go"                           # `go`                      - language for kewl kids
brew "shfmt"                        # `shfmt`                   - make ugly scripts less ugly
brew "tfenv"                        # `tfenv`                   - disguise outdated code by switching terraform versions
brew "terragrunt"                   # `terragrunt`              - DRY terraform
brew "pyenv"                        # `pyenv`                   - why system python always broken? why?? WHY???
brew "pipx"                         # `pipx`                    - AGAIN. WHY. SYSTEM. PYTHON. ALWAYS. BROKEN??? 
brew "podman"                       # `podman`                  - superior alternative to docker
brew "jq"                           # `jq`                      - query json
brew "yq"                           # `yq`                      - query yaml, csv, etc
brew "htmlq"                        # `htmlq`                   - like `jq` but for html
brew "age"                          # `age`                     - file encryption
brew "rage"                         # `rage`                    - like `age` but rust
brew "sops"                         # `sops`                    - secrets encrypted at rest
brew "deno"                         # `deno`                    - modern typescript runtime
brew "java"                         # `javac`                   - ew, java
brew "step"                         # `step`                    - selfhosted ca and cert tools
brew "mas"                          # `mas`                     - cli for downloading apps from the Mac App Store
brew "diff-so-fancy"                # `diff-so-fancy`           - fancy diff output
brew "serialosc"                    # `serialosc`               - monome usb 
brew "selenium-server"              # `selenium`                - headless browser stuff

# fonts: https://github.com/Homebrew/homebrew-cask-fonts
tap "homebrew/cask-fonts"
cask "font-mononoki"
cask "font-mononoki-nerd-font"
cask "font-hack-nerd-font"

# mac app store apps
mas "Aiko", id: 1672085276                # `aiko`                    - on-machine AI transcription
mas "Actions", id: 1586435171             # `actions`                 - automate apple stuff
mas "Hyperduck", id: 6444667067           # `hyperduck`               - airdrop but for everyone
mas "Microsoft Outlook", id: 985367838    # `outlook`                 - emails from m$
mas "Koala Sampler", id: 1479881366       # `koala`                   - a simple sampler